app/Http/Controllers/AdminController.php

    public function dashboard()
    {
        $totalinvoices = Invoice::count();
        $todaysinvoices = Invoice::where('created_at', '>=', Carbon\Carbon::today())->count();
        //$this->p($todaysinvoices); die();
        $totalProducts = Product::count();
        $totalBanks = BankDetails::count();
---
select count(*) as aggregate from `invoices`
select count(*) as aggregate from `invoices` where `created_at` >= '2017-09-18 00:00:00'
select count(*) as aggregate from `products`
select count(*) as aggregate from `bank_details`