app/Http/Controllers/AjaxController.php

    public function getproductDetails($product_id){
        $data = array();
        $categoryArray = Categories::where('product_id',$product_id)->pluck('name','id')->toArray();
        /*return view('admin.invoice.categorydropdown')
                        ->with('categoryArray',$categoryArray);
---
select `name`, `id` from `categories` where `product_id` = '1'