app/Http/Controllers/BankController.php

select `bank_details`.* from `bank_details` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `bank_details`
---
    public function index()
    {
            $bankdetails = BankDetails::select('bank_details.*')->orderBy('id', 'desc')
            ->paginate($this->rowPerPage);