app/Http/Controllers/InvoiceController.php

select `bank_name`, `id` from `bank_details`
select `name`, `id` from `states`
select * from `products`
select `name`, `id` from `categories`
---
    public function create()
    {
      // $request->session()->forget('key');
        Session::forget('productsArray');
        $invoice = strtotime("now");
        $bankDetail = BankDetails::pluck('bank_name','id')->toArray();
        $states = State::pluck('name','id')->toArray();
        $product = Product::with('categoryDetails')->get();
      //  $this->p($product);
        //die();
        $options = '';
        foreach($product as $pro){
            $dd = $pro->categoryDetails->toArray();
            //$this->p(count($dd));
             $this->p($dd);
            if(count($dd)>1){
                echo $dd[0]['rate']; echo '<br>';
            }else{
               // echo $dd['rate']; echo '<br>';
            }
        }
        echo $options;
        die();
        Session::push('productsArray', $product);
        $categories = Categories::pluck('name','id')->toArray();

select `name` from `states` where `id` = '1' limit 1
select * from `categories` where `id` in ('1')
---
    public function store(InvoiceRequest $request)
    {
        //echo $request->submitbutton;
        $data = $request->all();
        //$this->p($data); die();
        //$this->p($data['quantity']);
        //$invoice = strtotime("now");

        $totalAmount = $data['totalAmount'];
        $invoice = $data['invoice'];
        $invoice_date = $data['invoice_date'];
        $branch_name = $data['branch_name'];
        $state_id = $data['state_id'];
        $shippingcharges = $data['shippingcharges'];
        $bank_id = $data['bank_id'];
        $main_gst = $data['main_gst'];
        $gst_no = $data['gst_no'];
        $date = date('d-M-Y H:i:s',strtotime($invoice_date));
        $netPayableAmount = $data['netPayableAmount'];
        $discountAmount = $data['discountAmount'];
        $productIds = array_filter($data['product_id']);
        $sub_categoryIds = array_filter($data['sub_category']);
        $quantities = array_filter($data['quantity']);
        $ratebyquantities = array_filter($data['ratebyquantity']);
        //$this->p($quantities);
        //$this->p($sub_categoryIds);
        //echo count($quantities);
        $bankdetails = BankDetails::select('bank_details.bank_name')
                        ->where('bank_details.id', $bank_id)
                        ->first();
        $stateDetails = State::select('name')
                        ->where('id', $state_id)
                        ->first();
        ///$categoryDetails = Categories::whereIn('id',$sub_categoryIds)->get();
        $categoryDetails = Categories::whereIn('id',$sub_categoryIds)->with('productDetails')->get();

insert into `invoices` (`invoice`, `gst_no`, `invoice_date`, `statename`, `bank_id`, `bank_name`, `branch_name`, `discount`, `totalamount`, `shipping_charges`, `netpayableamount`, `gst`, `updated_at`, `created_at`) values ('1505753925', '', '2017-09-18 00:00:00', 'Andaman & Nicobar Islands', '2', 'City Bank', 'JJJJ', '40', '6750', '5', '8392.5', '25', '2017-09-18 16:59:50', '2017-09-18 16:59:50')
---
            $invoiceInsert->shipping_charges = $shippingcharges;
            $invoiceInsert->netpayableamount = $netPayableAmount;
            $invoiceInsert->gst = $main_gst;
            $invoiceInsert->save();

select * from `invoices` where `invoice` = '1505765928'
---
                return redirect()->route('print', ['invoice' => $invoice]);
            // return Redirect::route('print',['id'=>1]);
            //return redirect()->route('print', ['id' => 1]);
            return view('admin.invoice.print')
            ->with('productDetails',$categoryDetails)
            ->with('quantity',$quantities)
            ->with('ratebyquantities',$ratebyquantities)
            ->with('discountAmount',$discountAmount)
            ->with('totalAmount',$totalAmount)
            ->with('shippingcharges',$shippingcharges)
            ->with('main_gst',$main_gst)
            ->with('invoice',$invoice)
            ->with('bank_name',$bank_name)
            ->with('branch_name',ucwords($branch_name))
            ->with('state_name',$state_name)
            ->with('date',$date)
            ->with('netPayableAmount',$netPayableAmount);

select * from `invoice_details` where `invoice_details`.`invoice` in ('1505765928')
---
    public function printpreview($invoice)
    {
        if(!empty($invoice)) {
            $invoice = \App\Helpers\Common::decodeParam($invoice);
            $invoiceData = Invoice::select('*')->with('invoiceDetails')->where('invoice', $invoice)->get();