app/Http/Controllers/ProductController.php

    public function index()
    {
        $products = Product::select('*')->orderBy('id', 'desc')
                        ->paginate($this->rowPerPage);
---
select * from `products` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `products`

    public function store(ProductRequest $request)
    {
        $sizeArray = array();
        $data = $request->all();
        $products = new Product;
        $products->name         =   $request->name;
        $products->gst          =   $request->gst;
        $products->hsn          =   $request->hsn;
        $products->status       =   '1';
        $products->save();
        $lastProductId          =   $products->id;
        /* Inserting data in to another table  start*/

        $sizes = $request->get('size');
        $prices = $request->get('price');
        $i=0;
        foreach($sizes as $size){
            $subCategory   =   new Categories;
            $subCategory->name = $size;
            $subCategory->product_id = $lastProductId;
            $subCategory->rate = $prices[$i];
            $subCategory->save();
---
insert into `products` (`name`, `gst`, `hsn`, `status`, `updated_at`, `created_at`) values ('1-1', '11', '11', '1', '2017-09-18 18:58:14', '2017-09-18 18:58:14')
insert into `categories` (`name`, `product_id`, `rate`, `updated_at`, `created_at`) values ('NA', '11', '11', '2017-09-18 18:58:14', '2017-09-18 18:58:14')

    public function show($id)
    {
        if(!empty($id)) {
            $id = \App\Helpers\Common::decodeParam($id);
            $productdetails = Product::select('*')->where('id', $id)->first();
            $categorydetails = Categories::select('*')->where('product_id', $id)->get();
---
select * from `products` where `id` = '1' limit 1
select * from `categories` where `product_id` = '1'

    public function edit($id)
    {
        if(!empty($id)) {
            $id = \App\Helpers\Common::decodeParam($id);
            $productdetails = Product::select('*')->where('id', $id)->first();
            $categorydetails = Categories::select('*')->where('product_id', $id)->get();
---
select * from `products` where `id` = '5' limit 1
select * from `categories` where `product_id` = '5'

    public function update(ProductRequest $request)
    {
        $id = $request->id;
        if(!empty($id)) {
            $products = Product::find($id);
            Categories::where('product_id', '=', $id)->delete();
            $products->name         =   $request->name;
            $products->hsn          =   $request->hsn;
            $products->gst          =   $request->gst;
            $products->save();

            $sizes = array_filter($request->get('size'));
            $prices = array_filter($request->get('price'));
            $this->p($sizes);
            $this->p($prices);
            $i=0;
            foreach($sizes as $size){
                $subCategory   =   new Categories;
                $subCategory->name = $size;
                $subCategory->product_id = $id;
                $subCategory->rate = $prices[$i];
                $subCategory->save();
---
select * from `products` where `products`.`id` = '8' limit 1
delete from `categories` where `product_id` = '8'
insert into `categories` (`name`, `product_id`, `rate`, `updated_at`, `created_at`) values ('NA', '8', '545', '2017-09-18 18:37:39', '2017-09-18 18:37:39')